console.log("//////////////////////////////////");
console.log("/////////Задание 1.1//////////////");
console.log("//////////////////////////////////");
let x=213;
if(x<0)console.log(`${x} - число отрицательное`);
else if(x==0)console.log(`${x} - число равно нулю`);
else console.log(`${x} - число положительное`);
console.log("//////////////////////////////////");
let a="abvgdezhz";
console.log(`Длина строки ${a} = ${a.length}`);
console.log("//////////////////////////////////");
console.log(`Последний символ строки - ${a[a.length-1]}`);
console.log("//////////////////////////////////");
if(x%2==0)console.log(`Число ${x} - четное`);
else console.log(`Число ${x} - не четное`);
console.log("//////////////////////////////////");
let b="abevegedeiki"
if(a[0]==b[0])console.log(`Первые буквы строк ${a} и ${b} - совпадают`);
else console.log(`Первые буквы строк ${a} и ${b} -  не совпадают`);
console.log("//////////////////////////////////");
console.log("/////////Задание 1.2//////////////");
console.log("//////////////////////////////////");
let y=String(x);
console.log(`Первая цифра-${y[0]}`);
console.log("//////////////////////////////////");
console.log(`Последняя цифра-${y[y.length-1]}`);//почему если просто вписать сюда y[y.length] то пишет undefined
console.log("//////////////////////////////////");
let z1=Number(y[0]);
let z2=Number(y[y.length-1]);
console.log(`Сумма первой и последней цифры=${z1+z2}`);
console.log("//////////////////////////////////");
console.log(`Количество цифр в числе ${x} = ${y.length}`);
console.log("//////////////////////////////////");
let x0=228;
let y0=String(x0);
if(y[0]==y0[0])console.log(`Первые цифры чисел ${x} и ${x0} - совпадают`);
else console.log(`Первые цифры чисел ${x} и ${x0} - не совпадают`);
console.log("//////////////////////////////////");
console.log("/////////Задание 1.3//////////////");
console.log("//////////////////////////////////");
if(b.length>1)console.log(`Предпоследний символ строки ${b} - ${b[b.length-2]}`);
else console.log(`Строка "${b}" состоит из 1-го символа`);
console.log("//////////////////////////////////");
if(x%x0==0)console.log(`Число ${x} делится на ${x0} без остатка`);
else console.log(`Число ${x} делится на ${x0} с остатком`);
console.log("//////////////////////////////////");
console.log("/////////Задание 1.4//////////////");
console.log("//////////////////////////////////");
for(let i=0;i<=100;i++){
console.log(i);
}
console.log("//////////////////////////////////");
for(let i=-100;i<=0;i++){
console.log(i);
}
console.log("//////////////////////////////////");
for(let i=100;i>=1;i--){
console.log(i);
}
console.log("//////////////////////////////////");
for(let i=1;i<=100;i++){
if(i%2==0)console.log(i);
}
console.log("//////////////////////////////////");
for(let i=1;i<=100;i++){
if(i%3==0)console.log(i);
}
console.log("//////////////////////////////////");
console.log("/////////Задание 1.5//////////////");
console.log("//////////////////////////////////");
let x1=0;
for(let i=1;i<=100;i++){
console.log(x1+=i);
}
console.log("//////////////////////////////////");
let x2=0;
for(let i=1;i<=100;i++){
if(i%2==0)console.log(x2+=i);
}
console.log("//////////////////////////////////");
let x3=0;
for(let i=1;i<=100;i++){
if(i%2!=0)console.log(x3+=i);
}
console.log("//////////////////////////////////");
console.log(`Остаток от деления ${x}/${x0}=${x%x0}`);
console.log("//////////////////////////////////");
let bToArr=b.split("");
bToArr.reverse();
let bNew=bToArr.join("");
console.log(`Строка ${b} наоборот - ${bNew}`);
console.log("//////////////////////////////////");